stevenj/avr-libc3/include/avr/io/atmega6490a.h
/* BOOT_LOAD - Bootloader (0x00) */
#define BOOT_LOAD_BASE   _SFR_MEM8 (0x00) /* BOOT_LOAD Base Address */
#define BOOT_LOAD_SPMCSR _SFR_MEM8 (0x57) /* Store Program Memory Control Register */

/* LCD - Liquid Crystal Display (0x00) */
#define LCD_BASE         _SFR_MEM8 (0x00) /* LCD Base Address */
#define LCD_LCDCRA       _SFR_MEM8 (0xE4) /* LCD Control and Status Register A */
#define LCD_LCDCRB       _SFR_MEM8 (0xE5) /* LCD Control and Status Register B */
#define LCD_LCDFRR       _SFR_MEM8 (0xE6) /* LCD Frame Rate Register */
#define LCD_LCDCCR       _SFR_MEM8 (0xE7) /* LCD Contrast Control Register */
#define LCD_LCDDR0       _SFR_MEM8 (0xEC) /* LCD Data Register 0 */
#define LCD_LCDDR1       _SFR_MEM8 (0xED) /* LCD Data Register 1 */
#define LCD_LCDDR2       _SFR_MEM8 (0xEE) /* LCD Data Register 2 */
#define LCD_LCDDR3       _SFR_MEM8 (0xEF) /* LCD Data Register 3 */
#define LCD_LCDDR4       _SFR_MEM8 (0xF0) /* LCD Data Register 4 */
#define LCD_LCDDR5       _SFR_MEM8 (0xF1) /* LCD Data Register 5 */
#define LCD_LCDDR6       _SFR_MEM8 (0xF2) /* LCD Data Register 6 */
#define LCD_LCDDR7       _SFR_MEM8 (0xF3) /* LCD Data Register 7 */
#define LCD_LCDDR8       _SFR_MEM8 (0xF4) /* LCD Data Register 8 */
#define LCD_LCDDR9       _SFR_MEM8 (0xF5) /* LCD Data Register 9 */
#define LCD_LCDDR10      _SFR_MEM8 (0xF6) /* LCD Data Register 10 */
#define LCD_LCDDR11      _SFR_MEM8 (0xF7) /* LCD Data Register 11 */
#define LCD_LCDDR12      _SFR_MEM8 (0xF8) /* LCD Data Register 12 */
#define LCD_LCDDR13      _SFR_MEM8 (0xF9) /* LCD Data Register 13 */
#define LCD_LCDDR14      _SFR_MEM8 (0xFA) /* LCD Data Register 14 */
#define LCD_LCDDR15      _SFR_MEM8 (0xFB) /* LCD Data Register 15 */
#define LCD_LCDDR16      _SFR_MEM8 (0xFC) /* LCD Data Register 16 */
#define LCD_LCDDR17      _SFR_MEM8 (0xFD) /* LCD Data Register 17 */
#define LCD_LCDDR18      _SFR_MEM8 (0xFE) /* LCD Data Register 18 */
#define LCD_LCDDR19      _SFR_MEM8 (0xFF) /* LCD Data Register 19 */

/* EXINT - External Interrupts (0x00) */
#define EXINT_BASE       _SFR_MEM8 (0x00) /* EXINT Base Address */
#define EXINT_EIFR       _SFR_MEM8 (0x3C) /* External Interrupt Flag Register */
#define EXINT_EIMSK      _SFR_MEM8 (0x3D) /* External Interrupt Mask Register */
#define EXINT_EICRA      _SFR_MEM8 (0x69) /* External Interrupt Control Register A */
#define EXINT_PCMSK0     _SFR_MEM8 (0x6B) /* Pin Change Mask Register 0 */
#define EXINT_PCMSK1     _SFR_MEM8 (0x6C) /* Pin Change Mask Register 1 */
#define EXINT_PCMSK2     _SFR_MEM8 (0x6D) /* Pin Change Mask Register 2 */
#define EXINT_PCMSK3     _SFR_MEM8 (0x73) /* Pin Change Mask Register 3 */

/* FUSE - Fuses (0x00) */
#define FUSE_BASE        _SFR_MEM8 (0x00) /* FUSE Base Address */
#define FUSE_LOW         _SFR_MEM8 (0x00) 
#define FUSE_HIGH        _SFR_MEM8 (0x01) 
#define FUSE_EXTENDED    _SFR_MEM8 (0x02) 

/* LOCKBIT - Lockbits (0x00) */
#define LOCKBIT_BASE     _SFR_MEM8 (0x00) /* LOCKBIT Base Address */
#define LOCKBIT_LOCKBIT  _SFR_MEM8 (0x00) 
/* avr-libc typedef for avr/fuse.h */
typedef FUSE_t NVM_FUSES_t;

/*
================================================================================
Interrupt Vector Definitions
================================================================================
*/

/* Vector 0 is the reset vector */
#define None_RESET_vect_num        (0)                 
#define None_RESET_vect            _VECTOR(0)          /* External Pin,Power-on Reset,Brown-out Reset,Watchdog Reset,and JTAG AVR Reset. See Datasheet.      */
#define None_INT0_vect_num         (1)                 
#define None_INT0_vect             _VECTOR(1)          /* External Interrupt Request 0 */
#define None_PCINT0_vect_num       (2)                 
#define None_PCINT0_vect           _VECTOR(2)          /* Pin Change Interrupt Request 0 */
#define None_PCINT1_vect_num       (3)                 
#define None_PCINT1_vect           _VECTOR(3)          /* Pin Change Interrupt Request 1 */
#define None_TIMER2_COMP_vect_num  (4)                 
#define None_TIMER2_COMP_vect      _VECTOR(4)          /* Timer/Counter2 Compare Match */
#define None_TIMER2_OVF_vect_num   (5)                 
#define None_TIMER2_OVF_vect       _VECTOR(5)          /* Timer/Counter2 Overflow */
#define None_TIMER1_CAPT_vect_num  (6)                 
#define None_TIMER1_CAPT_vect      _VECTOR(6)          /* Timer/Counter1 Capture Event */
#define None_TIMER1_COMPA_vect_num (7)                 
#define None_TIMER1_COMPA_vect     _VECTOR(7)          /* Timer/Counter1 Compare Match A */
#define None_TIMER1_COMPB_vect_num (8)                 
#define None_TIMER1_COMPB_vect     _VECTOR(8)          /* Timer/Counter Compare Match B */
#define None_TIMER1_OVF_vect_num   (9)                 
#define None_TIMER1_OVF_vect       _VECTOR(9)          /* Timer/Counter1 Overflow */
#define None_TIMER0_COMP_vect_num  (10)                
#define None_TIMER0_COMP_vect      _VECTOR(10)         /* Timer/Counter0 Compare Match */
#define None_TIMER0_OVF_vect_num   (11)                
#define None_TIMER0_OVF_vect       _VECTOR(11)         /* Timer/Counter0 Overflow */
#define None_SPI_STC_vect_num      (12)                
#define None_SPI_STC_vect          _VECTOR(12)         /* SPI Serial Transfer Complete */
#define None_USART_RX_vect_num     (13)                
#define None_USART_RX_vect         _VECTOR(13)         /* USART, Rx Complete */
#define None_USART_UDRE_vect_num   (14)                
#define None_USART_UDRE_vect       _VECTOR(14)         /* USART Data register Empty */
#define None_USART0_TX_vect_num    (15)                
#define None_USART0_TX_vect        _VECTOR(15)         /* USART0, Tx Complete */
#define None_USI_START_vect_num    (16)                
#define None_USI_START_vect        _VECTOR(16)         /* USI Start Condition */
#define None_USI_OVERFLOW_vect_num (17)                
#define None_USI_OVERFLOW_vect     _VECTOR(17)         /* USI Overflow */
#define None_ANALOG_COMP_vect_num  (18)                
#define None_ANALOG_COMP_vect      _VECTOR(18)         /* Analog Comparator */
#define None_ADC_vect_num          (19)                
#define None_ADC_vect              _VECTOR(19)         /* ADC Conversion Complete */
#define None_EE_READY_vect_num     (20)                
#define None_EE_READY_vect         _VECTOR(20)         /* EEPROM Ready */
#define None_SPM_READY_vect_num    (21)                
#define None_SPM_READY_vect        _VECTOR(21)         /* Store Program Memory Read */
#define None_LCD_vect_num          (22)                
#define None_LCD_vect              _VECTOR(22)         /* LCD Start of Frame */
#define None_PCINT2_vect_num       (23)                
#define None_PCINT2_vect           _VECTOR(23)         /* Pin Change Interrupt Request 2 */
#define None_PCINT3_vect_num       (24)                
#define None_PCINT3_vect           _VECTOR(24)         /* Pin Change Interrupt Request 3 */

/* Vector Table Size */
#define _VECTOR_SIZE               (4)                 /* Size of individual vector. */
#define _VECTORS_SIZE              (25 * _VECTOR_SIZE) /* Size of all vectors */
/*
================================================================================
Constants
================================================================================
*/

